<?php
    define('WEBSIZE', 'http://localhost/googlejob/branches/master/'); //网站路径
    define('WBURL', 'http://www.dazake.com/'); //发微博传送的url
    define('CREATER', 'johndok'); //网站路径 
	$message = 'OMG，2012年里，原来@'.$_POST['username'].'的幸运日是在这一天，不知道是要走桃花运还是会有天降之财，赶快来测测你的幸运日是哪一天？' . WBURL ;

	$con_arr = array();	
	$con_arr[0][0] = "         每天都会收到同样的QQ诈";
	$con_arr[0][1] = '骗信息？今天的不是！居然中了';
	$con_arr[0][2] = '腾讯公司抽中的年度大奖——好';
	$con_arr[0][3] = '吧，其实只是一套价值2QB的QQ';
	$con_arr[0][4] = '秀。但是对于苦逼的人民来说,有';
	$con_arr[0][5] = '总比没有好不是。';
	
	$con_arr[1][0] = "           参加演讲比赛，虽然只获";
	$con_arr[1][1] = "得参与奖，却因为淳朴的谈吐捕";
	$con_arr[1][2] = "获住了美人的芳心。";
	
	$con_arr[2][0] = "       逛街途中偶然发现“爆头哥”";
	$con_arr[2][1] = "踪迹，果断向有关部门举报，获";
	$con_arr[2][2] = "得赏金3W元。";
	
	$con_arr[3][0] = "       What a lucky day！！KTV";
	$con_arr[3][1] = "与同学K歌,因演唱一曲《伤不起》";
	$con_arr[3][2] = "被星探发掘……";
	
	$con_arr[4][0] = "       去街头算命，偶然算出自己";
	$con_arr[4][1] = "有一位身居美帝的远房亲戚把自";
	$con_arr[4][2] = "己所有的遗产留给了唯一的亲人。";
	
	$con_arr[5][0] = "       去食堂吃肉包子，误食半条";
	$con_arr[5][1] = "肉虫后举报上级，获得一年免费";
	$con_arr[5][2] = "饭票。";
	
	$con_arr[6][0] = "         今天，你转发了大量微博，";
	$con_arr[6][1] = "获得当日的微博之星称号,得到与";
	$con_arr[6][2] = "杜海涛一起去越南蜜月之行的机";
	$con_arr[6][3] = "会.";
	
	
	$con_arr[7][0] = "       今天是Hold不住的一天，你";
	$con_arr[7][1] = "在街头与人发生争执而认识了一";
	$con_arr[7][2] = "生最重要的朋友。";
	
	
	$con_arr[8][0] = "        今天你要花费大量的时间去";
	$con_arr[8][1] = "逛淘宝，会以意想不到的价格买";
	$con_arr[8][2] = "到自己心仪许久的衣服。";
	
	
	$con_arr[9][0] = "         只要今天你的手机不欠费";
	$con_arr[9][1] = ",就会收到很久没有联系的初恋";
	$con_arr[9][2] = "情人的短信噢！~ 是不是又能燃";
	$con_arr[9][3] = "起一段新的恋情捏？";
		
                     // 
	$con_arr[10][0] = "         天哪，今天你无意中被蜘";
	$con_arr[10][1] = "蛛咬了一口，然后……你就成了";
	$con_arr[10][2] = "蜘蛛侠，快去买紧身衣吧！！";
	
	                          //
	$con_arr[11][0] = "         今天的你发现了传说中的";
	$con_arr[11][1] = "“吃一口就升仙面条”，疲惫了";
	$con_arr[11][2] = "N久的身体一下子原地满血复活";
	$con_arr[11][3] = "了！";
	
	                          //
	$con_arr[12][0] = "         保持开机，今天会有正妹";
	$con_arr[12][1] = "来约你噢！";
	
	               //
	$con_arr[13][0] = "         穿上你最好的装备努力的";
	$con_arr[13][1] = "下副本吧！今天你会打到一件梦";
	$con_arr[13][2] = "幻装备噢！";
	
	                          // 
	$con_arr[14][0] = "         还不相信彩票么？你确定";
	$con_arr[14][1] = "你真的不信么？今天赶紧去彩票";
	$con_arr[14][2] = "站吧，一张“机选”会让你中得";
	$con_arr[14][3] = "大奖！";
	
	                          //
	$con_arr[15][0] = "         今天，如果在街上看见献";
	$con_arr[15][1] = "血车千万不要错过噢！勇敢地献";
	$con_arr[15][2] = "血会得到美丽护士的爱的鼓励。";
	
		                      
	$con_arr[16][0] = "         赌场失意情场得意的一天";
	$con_arr[16][1] = "，今天不要去打牌，记得与爱人";
	$con_arr[16][2] = "一起约会，或者向心爱的人表白，";
	$con_arr[16][3] = "会有不错的结果。";
	
	                          //
	$con_arr[17][0] = "         今天的你在酒场上大战三";
	$con_arr[17][1] = "百回合，将数人斩落马下，终于";
	$con_arr[17][2] = "获得了期待的合约，得到了老板";
	$con_arr[17][3] = "的大大的赞许！ ";
	
	                 // 
	$con_arr[18][0] = "         哎呦不错噢，很吊噢。招";
	$con_arr[18][1] = "聘结果下来啦，恭喜您以全市第";
	$con_arr[18][2] = "一的成绩被录取啦！快去请朋友";
	$con_arr[18][3] = "一起去庆祝吧~ ";
	
	                          // 
	$con_arr[19][0] = "         每天都会收到同样的QQ诈";
	$con_arr[19][1] = "骗信息？今天的不是！居然中了";
	$con_arr[19][2] = "腾讯公司抽中的年度大奖——好";
	$con_arr[19][3] = "吧，其实只是一套价值2QB的";
	$con_arr[19][4] = "QQ秀。但是对于苦逼的人民来";
	$con_arr[19][5] = "说，有总比没有好不是。";
	
	                          // 
	$con_arr[20][0] = "         今天的你在家进行大扫除";
	$con_arr[20][1] = "，意外发现了祖父留下的绝世武";
	$con_arr[20][2] = "功秘籍。但是打开一看，直接傻";
	$con_arr[20][3] = "眼——葵花宝典。";
	
	                          // 
	$con_arr[21][0] = "         今天的你如果去晨练的话";
	$con_arr[21][1] = "，会有意想不到的收获噢！";
	
	                          // 
	$con_arr[22][0] = "         峰回路转的一天，早晨你";
	$con_arr[22][1] = "还因为踩到狗屎而闷闷不乐，晚";
	$con_arr[22][2] = "上回家却发现鞋底上的狗屎粘住";
	$con_arr[22][3] = "了一张百元大钞！HOLY SHIT！";
	
	                          //
	$con_arr[23][0] = "         勇敢地开车上路吧，今天";
	$con_arr[23][1] = "的你会一路绿灯噢！";
	
	                          //
	$con_arr[24][0] = "         今天一整天要低头注意地";
	$con_arr[24][1] = "面，会有天降之财。";
	                          //
	$con_arr[25][0] = "         赶紧在这一天买一张彩票";
	$con_arr[25][1] = "吧。。。";

	
	
	
//获取ip函数
function getIP() { 
if (@$_SERVER["HTTP_X_FORWARDED_FOR"]) 
$ip = $_SERVER["HTTP_X_FORWARDED_FOR"]; 
else if (@$_SERVER["HTTP_CLIENT_IP"]) 
$ip = $_SERVER["HTTP_CLIENT_IP"]; 
else if (@$_SERVER["REMOTE_ADDR"]) 
$ip = $_SERVER["REMOTE_ADDR"]; 
else if (@getenv("HTTP_X_FORWARDED_FOR"))
$ip = getenv("HTTP_X_FORWARDED_FOR"); 
else if (@getenv("HTTP_CLIENT_IP")) 
$ip = getenv("HTTP_CLIENT_IP"); 
else if (@getenv("REMOTE_ADDR")) 
$ip = getenv("REMOTE_ADDR"); 
else 
$ip = "Unknown"; 
return $ip; 
}
?>